# Append Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
SlabShapeCreaseArray..::..Append Method
SlabShapeCreaseArray Class See Also
---
Add the item to the end of the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Append(
	SlabShapeCrease item
)
```

Visual Basic
---
```text
Public Overridable Sub Append ( _
	item As SlabShapeCrease _
)
```

Visual C++
---
```text
public:
virtual void Append(
	SlabShapeCrease^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..SlabShapeCreaseThe item to be added.
# See Also
SlabShapeCreaseArray Class
Autodesk.Revit.DB Namespace